In [4]:
import csv
from rdflib import Graph, Literal, Namespace, URIRef
from rdflib.namespace import DCTERMS, RDF, RDFS, SKOS, XSD
import pandas as pd
# import rdfpandas

In [5]:
# pip install rdflib

In [7]:
Assigned_Hours=pd.read_csv('Assigned_Hours.csv')
Course_Instances=pd.read_csv('Course_Instances.csv')
Course_plannings=pd.read_csv('Course_plannings.csv')
Courses=pd.read_csv('Courses.csv')
Programme_Courses=pd.read_csv('Programme_Courses.csv')
Programmes=pd.read_csv('Programmes.csv')
Registrations=pd.read_csv('Registrations.csv')
Reported_Hours=pd.read_csv('Reported_Hours.csv')
Senior_Teachers=pd.read_csv('Senior_Teachers.csv')
Students=pd.read_csv('Students.csv')
Teaching_Assistants=pd.read_csv('Teaching_Assistants.csv')

# Teaching Assistants

In [8]:
Teaching_Assistants.head()

  Teacher name     Teacher id Department name Division name
0       TA 151  19780321-0151              D1          D1-2
1       TA 152  19751107-0152              D7          D7-2
2       TA 153  19760106-0153              D7          D7-0
3       TA 154  19780210-0154              D6          D6-5
4       TA 155  19750330-0155              D1          D1-5

In [9]:
Teaching_Assistants.rename(columns={"Teacher name": "personName", "Teacher id": "personID", "Department name": "departmentName",'Division name': "divisionName"}, inplace=True)

In [10]:
Teaching_Assistants['personName'] = Teaching_Assistants['personName'].str.replace(' ','-')

In [11]:
Teaching_Assistants.columns

Index(['personName', 'personID', 'departmentName', 'divisionName'], dtype='object')

In [12]:
Teaching_Assistants.head()

  personName       personID departmentName divisionName
0     TA-151  19780321-0151             D1         D1-2
1     TA-152  19751107-0152             D7         D7-2
2     TA-153  19760106-0153             D7         D7-0
3     TA-154  19780210-0154             D6         D6-5
4     TA-155  19750330-0155             D1         D1-5

In [13]:
#http://www.semanticweb.org/keyha/ontologies/2022/3/untitled-ontology-11#

# make a graph
output_graph = Graph()
uri="http://www.semanticweb.org/keyha/ontologies/2022/3/untitled-ontology-11#"

for index, row in Teaching_Assistants.iterrows():

    # make a triple with the object as uri
    output_graph.add(  (URIRef(uri+row.personID),
                        URIRef(uri+"Domain"),
                        URIRef(uri+"Person") ))
    
    output_graph.add(  (URIRef(uri+row.personName),
                        URIRef(uri+"Domain"),
                        URIRef(uri+"Person") ))
    
    output_graph.add(  (URIRef(uri+row.departmentName),
                        URIRef(uri+"Domain"),
                        URIRef(uri+"Department") ))
    
    output_graph.add(  (URIRef(uri+row.divisionName),
                        URIRef(uri+"Domain"),
                        URIRef(uri+"Devision") ))

# Senior Teachers

In [18]:
Senior_Teachers.head()

  Teacher name     Teacher id Department name Division name
0    Teacher 1  19550711-0001              D1          D1-3
1    Teacher 2  19640131-0002              D3          D3-5
2    Teacher 3  19590109-0003              D7          D7-3
3    Teacher 4  19641017-0004              D1          D1-3
4    Teacher 5  19630316-0005              D5          D5-2

In [19]:
Senior_Teachers.rename(columns={"Teacher name": "personName", "Teacher id": "personID", "Department name": "departmentName",'Division name': "divisionName"}, inplace=True)

In [20]:
Senior_Teachers['personName'] = Teaching_Assistants['personName'].str.replace(' ','-')

In [21]:
Senior_Teachers.columns

Index(['personName', 'personID', 'departmentName', 'divisionName'], dtype='object')

In [22]:
Senior_Teachers.head()

  personName       personID departmentName divisionName
0     TA-151  19550711-0001             D1         D1-3
1     TA-152  19640131-0002             D3         D3-5
2     TA-153  19590109-0003             D7         D7-3
3     TA-154  19641017-0004             D1         D1-3
4     TA-155  19630316-0005             D5         D5-2

In [13]:
#http://www.semanticweb.org/keyha/ontologies/2022/3/untitled-ontology-11#

# make a graph
output_graph = Graph()
uri="http://www.semanticweb.org/keyha/ontologies/2022/3/untitled-ontology-11#"

for index, row in Teaching_Assistants.iterrows():

    # make a triple with the object as uri
    output_graph.add(  (URIRef(uri+row.personID),
                        URIRef(uri+"Domain"),
                        URIRef(uri+"Person") ))
    
    output_graph.add(  (URIRef(uri+row.personName),
                        URIRef(uri+"Domain"),
                        URIRef(uri+"Person") ))
    
    output_graph.add(  (URIRef(uri+row.departmentName),
                        URIRef(uri+"Domain"),
                        URIRef(uri+"Department") ))
    
    output_graph.add(  (URIRef(uri+row.divisionName),
                        URIRef(uri+"Domain"),
                        URIRef(uri+"Devision") ))

# Course

# ProgramCourses

#Students

# Reported_Hours

# Registrations

# Programmes

#Course_Planning

# Course_Instances

#AssignedHours

# Graph output

In [ ]:
output_graph.serialize('mycsv2rdf.ttl',format='turtle')